IBtaskR/WorkAround/XML/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидЦены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

IBtaskR/WorkAround/XML/CommonModules/РаботаСоСправочниками/Ext/Module.bsl
Function ПолучитьЗакупочнуюЦенуТовара(Номенклатура) Export
	Отбор = New Structure;
	Отбор.Insert("Номенклатура", Номенклатура);
	Отбор.Insert("ВидЦены", Catalogs.ВидЦены.Закупочная);
	Значение = InformationRegisters.ЦеныНоменклатуры.GetLast(EndOfMonth(CurrentDate()), Отбор);
	Return Значение.Цена;
EndFunction

Function ПолучитьРозничнуюЦенуТовара(Номенклатура) Export
	Отбор = New Structure;
	Отбор.Insert("Номенклатура", Номенклатура);
	Отбор.Insert("ВидЦены", Catalogs.ВидЦены.Розничная);
	Значение = InformationRegisters.ЦеныНоменклатуры.GetLast(EndOfMonth(CurrentDate()), Отбор);
	Return Значение.Цена;
EndFunction
